In [1]:
import pandas as pd
import numpy as np

In [19]:
data= {'kor':[10,30,70,70],
       'eng':[20,40,80,60],
       'math':[33,44,55,66]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   70   80    55
d   70   60    66

In [5]:
# df.max()
df.loc['max'] =df.max()
df

     kor  eng  math
a     10   20    33
b     30   40    44
c     70   80    55
d     70   60    66
max   70   80    66

In [10]:
# df.max(axis=0) #
df.max(axis=1) #
df['max'] =df.max(axis=1)
df

   kor  eng  math  max
a   10   20    33   33
b   30   40    44   44
c   70   80    55   80
d   70   60    66   70

In [15]:
df.max().max()

80

In [18]:
# df.sum()
df.sum(axis=1)
df['sum']=df.sum(axis=1)
df

   kor  eng  math  sum
a   10   20    33   63
b   30   40    44  114
c   70   80    55  205
d   70   60    66  196

In [20]:
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   70   80    55
d   70   60    66

In [22]:
df.sum().sum()

578

In [24]:
# df.mean()
df.mean(axis=1)

a    21.000000
b    38.000000
c    68.333333
d    65.333333
dtype: float64

In [25]:
df.median()

kor     50.0
eng     50.0
math    49.5
dtype: float64

In [26]:
df.std()

kor     30.000000
eng     25.819889
math    14.200939
dtype: float64

In [28]:
df.quantile( [0.2,0.5,0.9] )

      kor   eng  math
0.2  22.0  32.0  39.6
0.5  50.0  50.0  49.5
0.9  70.0  74.0  62.7

In [30]:
df.count()

kor     4
eng     4
math    4
dtype: int64

In [34]:
df.describe()
# df.describe().loc['count']
# df.describe().loc['mean']

        kor        eng       math
count   4.0   4.000000   4.000000
mean   45.0  50.000000  49.500000
std    30.0  25.819889  14.200939
min    10.0  20.000000  33.000000
25%    25.0  35.000000  41.250000
50%    50.0  50.000000  49.500000
75%    70.0  65.000000  57.750000
max    70.0  80.000000  66.000000